venkatarajasekhar/mplab-harmony/apps/gfx/media_image_viewer/firmware/src/system_config/pic32mz_ef_sk_meb2_wvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
    }
    return;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxXGet()

  Summary:
     Returns x extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxXGet()
{
    return drvLCCObj.maxX;
}

// *****************************************************************************
/*
  Function:
     void DRV_GFX_LCC_MaxYGet()

  Summary:
     Returns y extent of the display.

  Description:

  Precondition:

  Parameters:

  Returns:

  Example:
    <code>
    <code>

  Remarks:
*/
uint16_t DRV_GFX_LCC_MaxYGet()
{
    return drvLCCObj.maxY;
}

/*********************************************************************
  Function:
     void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )

  Summary:
    Returns the API of the graphics controller

  Description:
    none

  Return:

  *********************************************************************/
void DRV_GFX_LCC_InterfaceSet( DRV_HANDLE handle, DRV_GFX_INTERFACE * interface )
{
    interface->BarFill = DRV_GFX_LCC_BarFill;
    interface->PixelArrayPut = DRV_GFX_LCC_PixelArrayPut;
    interface->PixelArrayGet = DRV_GFX_LCC_PixelArrayGet;
    interface->PixelPut = DRV_GFX_LCC_PixelPut;
    interface->ColorSet = DRV_GFX_LCC_SetColor;
    interface->PageSet = DRV_GFX_LCC_SetPage;
    interface->MaxXGet = DRV_GFX_LCC_MaxXGet;
    interface->MaxYGet = DRV_GFX_LCC_MaxYGet;
}

uint16_t DRV_GFX_LCC_SetPage(uint8_t pageType, uint8_t page)
{

        switch(pageType)
        {
            case ACTIVE_PAGE:
                drvLCCObj.initData->activePage = page;
            if ( drvLCCObj.initData->activePage == 0 )
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS0;
            else
                _ebiBaseAddress = (uint16_t*)SRAM_ADDR_CS1;
                break;
            case VISUAL_PAGE:
                drvLCCObj.initData->visualPage = page;
                break;
        }

        return(0);
}
// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_SetColor(uint8_t instance, GFX_COLOR color)

  Summary: Sets the color for the driver instance

  Description:
  
  Output: none

*/

void DRV_GFX_LCC_SetColor(GFX_COLOR color)
{
  drvLCCObj.initData->color = color;
}

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_DisplayRefresh(void)

  Summary: State Machine driving H-Sync, V-Sync and DE timing

  Description:
  
  Output: none

*/

void DRV_GFX_LCC_DisplayRefresh(void)
{
    typedef enum
	{
        HSYNC_FRONT_PORCH,
        HSYNC_PULSE,
        HSYNC_BACK_PORCH,
        HSYNC_DATA_ENABLE,
        HSYNC_DATA_ENABLE_OVERFLOW        
    } HSYNC_STATES;

    typedef enum
    {
        VSYNC_FRONT_PORCH,
        VSYNC_PULSE,
        VSYNC_BACK_PORCH,
        VSYNC_BLANK        
    } VSYNC_STATES;

    static int16_t line = 0;
    static uint16_t pixels = 0;
    static uint32_t hSyncs = 0;
    
    static uint32_t vsyncPeriod = DISP_VER_FRONT_PORCH + DISP_VER_RESOLUTION + DISP_VER_BACK_PORCH;
    static uint32_t vsyncPulseDown = 0;
    static uint32_t vsyncPulseUp = 0;
    static uint32_t vsyncEnd = 0;

    static HSYNC_STATES hsyncState = HSYNC_FRONT_PORCH;
    static VSYNC_STATES vsyncState = VSYNC_BLANK;

    switch(vsyncState)
    {
        case VSYNC_FRONT_PORCH:
            if (hSyncs > vsyncPulseDown)
            {
                BSP_LCD_VSYNCOff();
                vsyncPulseUp = hSyncs + DISP_VER_PULSE_WIDTH;
                vsyncState = VSYNC_PULSE;

				if(drvLCCObj.vsync_cb != NULL)
					drvLCCObj.vsync_cb();

                allowFrameUpdate = false;
                line = 0;
                BSP_SRAM_A16StateSet(0&0x1);
                BSP_SRAM_A17StateSet(drvLCCObj.initData->visualPage&0x1);
                BSP_SRAM_A18StateSet(drvLCCObj.initData->visualPage&0x1);
				if ( drvLCCObj.initData->visualPage == 1 )
					overflowcount = 6;
				else
					overflowcount = 0;

                BSP_SRAM_A19StateSet(0&0x1);
            }
            break;
        case VSYNC_PULSE:
            if (hSyncs >= vsyncPulseUp)
            {
                BSP_LCD_VSYNCOn();
                vsyncEnd = hSyncs + DISP_VER_BACK_PORCH;
                vsyncState = VSYNC_BACK_PORCH;
            }
            break;
        case VSYNC_BACK_PORCH:
            if (hSyncs >= vsyncEnd)
            {
                vsyncState = VSYNC_BLANK;
            }
            break;
        case VSYNC_BLANK:
            break;
    }

    switch (hsyncState)
    {
        case HSYNC_FRONT_PORCH:
            BSP_LCD_DEOff();
            hsyncState = HSYNC_PULSE;
            allowLineUpdate = true;
			if (DISP_HOR_FRONT_PORCH > 0)
			{
	            pixels = DISP_HOR_FRONT_PORCH;
	            break;
			}
        case HSYNC_PULSE:
            BSP_LCD_HSYNCOff();
            if (hSyncs >= vsyncPeriod)
            {
				vsyncPeriod = hSyncs + DISP_VER_PULSE_WIDTH + DISP_VER_FRONT_PORCH + DISP_VER_RESOLUTION + DISP_VER_BACK_PORCH;
                vsyncPulseDown = hSyncs + DISP_VER_FRONT_PORCH;
                vsyncState = VSYNC_FRONT_PORCH;
                allowFrameUpdate = true;
            }
            hSyncs++; 
            pixels = DISP_HOR_PULSE_WIDTH;
            hsyncState = HSYNC_BACK_PORCH;  
            break;
        case HSYNC_BACK_PORCH:
            BSP_LCD_HSYNCOn();
            hsyncState = HSYNC_DATA_ENABLE; 
            allowLineUpdate = false;
			if (DISP_HOR_BACK_PORCH > 0)
			{
				pixels = DISP_HOR_BACK_PORCH;
				break;
			}
        case HSYNC_DATA_ENABLE:
            if (vsyncState == VSYNC_BLANK)
            {
                BSP_LCD_DEOn();

                PMADDR = ((PMP_ADDRESS_LINES) & ((line++) * DISP_HOR_RESOLUTION));
                if((PMADDR_OVERFLOW - PMADDR) < (DISP_HOR_RESOLUTION))       
				{   
					hsyncState = HSYNC_DATA_ENABLE_OVERFLOW;      //Do Overflow routine
					PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t)(((PMADDR_OVERFLOW)- PMADDR)<<1));
					PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
					PLIB_DMA_ChannelXEnable(DMA_ID_0,DRV_GFX_LCC_DMA_CHANNEL_INDEX);
                    pixels = DISP_HOR_RESOLUTION - ((PMADDR_OVERFLOW)- PMADDR);
					return;
				}
			}
            pixels = DISP_HOR_RESOLUTION;
            hsyncState = HSYNC_FRONT_PORCH;
			break;
        case HSYNC_DATA_ENABLE_OVERFLOW:
            BSP_SRAM_A16StateSet(++overflowcount&0x1);
            BSP_SRAM_A17StateSet(overflowcount>>1&0x1);
            BSP_SRAM_A18StateSet(overflowcount>>2&0x1);
            BSP_SRAM_A19StateSet(overflowcount>>3&0x1);
            hsyncState = HSYNC_FRONT_PORCH;
            break;
    }

    PLIB_DMA_ChannelXDestinationSizeSet(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, (uint16_t)(pixels<<1));
    PLIB_DMA_ChannelXINTSourceFlagClear(DMA_ID_0, DRV_GFX_LCC_DMA_CHANNEL_INDEX, DMA_INT_BLOCK_TRANSFER_COMPLETE);
    SYS_DMA_ChannelEnable(dmaHandle);
}
  
// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_PixelPut(uint16_t x, uint16_t y)

  Summary:
    outputs one pixel into the frame buffer at the x,y coordinate given

  Description:
    none

