venkatarajasekhar/mplab-harmony/apps/gfx/media_image_viewer/firmware/src/system_config/pic32mz_ef_sk_meb2_wvga/framework/driver/gfx/controller/lcc/drv_gfx_lcc_generic.c
  Input:
        x,y - pixel coordinates
  Output:
    1 - call not successful (lcc driver busy)
    0 - call successful
*/
void DRV_GFX_LCC_PixelPut(uint16_t x, uint16_t y)
{
    _framePoint = (uint16_t*)_ebiBaseAddress + (((y)*(DISP_HOR_RESOLUTION))+(x));
    LCCSaveData();

    *_framePoint++ = drvLCCObj.initData->color;
    LCCRecoverData();
}  

// *****************************************************************************
/*
  Function: void DRV_GFX_LCC_BarFill(uint16_t left, uint16_t top, uint16_t right, uint16_t bottom)

  Summary:
    outputs one pixel into the frame buffer at the x,y coordinate given

  Description:
    none

  Input:
        left,top - pixel coordinates
        right, bottom - pixel coordinates

  Output:
          1 - call not successful (lcc driver busy)
          0 - call successful
*/
void  DRV_GFX_LCC_BarFill(uint16_t left, uint16_t top, uint16_t right, uint16_t bottom)
{
    uint16_t lineCount = bottom - top + 1;//vchange;
    uint16_t count = right - left + 1;//hchange;
    _frameAddress = (uint32_t)(((top)*(DISP_HOR_RESOLUTION))+(left));

    while(lineCount)
    {
       _framePoint = (uint16_t*)_ebiBaseAddress + (_frameAddress);
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
          /*Suspend DMA Trigger*/
          LCCSaveData();
		if(_pixelRendercount > 8) //Write 8 pixels at once
		{
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			*_framePoint++ = drvLCCObj.initData->color;
			_pixelRendercount -= 7;
			_frameAddress += 7;
		}

		*_framePoint++ = drvLCCObj.initData->color;
        LCCRecoverData();
        _frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
}  

// *****************************************************************************
/*
  Function: void  DRV_GFX_LCC_PixelArrayPut(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color 

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
		  x - x coordinate of the start point.
		  y - y coordinate of the end point.
		  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
void  DRV_GFX_LCC_PixelArrayPut(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count, uint16_t lineCount)
{
    _frameAddress = (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));

    while(lineCount)
    {
       _framePoint = (uint16_t*)_ebiBaseAddress + (_frameAddress);
       for(_pixelRendercount = count; _pixelRendercount > 0; _pixelRendercount--)
       {
          /*Suspend DMA Trigger*/
          LCCSaveData();
        if(_pixelRendercount > 8) //Write 8 pixels at once
        {
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			*_framePoint++ = *color++;
			_pixelRendercount -= 7;
			_frameAddress += 7;
        }

        *_framePoint++ = *color++;
        LCCRecoverData();
        _frameAddress++;
       }
       _frameAddress += (DISP_HOR_RESOLUTION - count);
       lineCount--;
    }
} 

// *****************************************************************************
/*
  Function: uint16_t*  DRV_GFX_LCC_PixelArrayGet(uint16_t *color, uint16_t x, uint16_t y, uint16_t count)

  Summary:
    outputs an array of pixels of length count starting at *color 

  Description:
    none

  Input:
          instance - driver instance
          *color - start of the array
		  x - x coordinate of the start point.
		  y - y coordinate of the end point.
		  count - number of pixels
  Output:
         handle to the number of pixels remaining
*/
uint16_t*  DRV_GFX_LCC_PixelArrayGet(GFX_COLOR *color, uint16_t x, uint16_t y, uint16_t count)
{
     _frameAddress =  (uint32_t)(((y)*(DISP_HOR_RESOLUTION))+(x));
              _framePoint = (uint16_t*)_ebiBaseAddress + (_frameAddress);
              while(count)
              {
                /*Suspend DMA Trigger*/
                LCCSaveData();
                if(count > 4) // Read 4 pixels at once
                {
                    *color++ = *_framePoint++;
                    count -= 3;
                    *color++ = *_framePoint++;
                    _frameAddress += 3;
                    *color++ = *_framePoint++;
                }
                *color++ = *_framePoint++;

                LCCRecoverData();
                
                _frameAddress++;
                count--;
              }
    return 0;
}


uint16_t prevaddr;

inline void LCCSaveData(void)
{
    while ( allowFrameUpdate == false && allowLineUpdate == false ) ;
    PLIB_OSC_PBClockDivisorSet (OSC_ID_0, 7, 1);
    CFGEBIA = 0x000fffff;
    CFGEBIC = 0x00002003;
}

inline void LCCRecoverData(void)
{
    CFGEBIA = 0;
    CFGEBIC = 0;
    PLIB_OSC_PBClockDivisorSet (OSC_ID_0, 7, 1);
}

// *****************************************************************************
/* Function:
    SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )

  Summary:
    Returns status of the specific module instance of the Driver module.

  Description:
    This function returns the status of the specific module instance disabling its
    operation (and any hardware for driver modules).

  PreCondition:
    The DRV_GFX_LCC_Initialize function should have been called before calling
    this function.

  Parameters:
    object          - DRV_GFX_LCC object handle, returned from DRV_GFX_LCC_Initialize

  Returns:
    SYS_STATUS_READY    Indicates that any previous module operation for the
                        specified module has completed

    SYS_STATUS_BUSY     Indicates that a previous module operation for the
                        specified module has not yet completed

    SYS_STATUS_ERROR    Indicates that the specified module is in an error state
*/

SYS_STATUS DRV_GFX_LCC_Status ( SYS_MODULE_OBJ object )
{
    DRV_GFX_LCC_OBJ *dObj = (DRV_GFX_LCC_OBJ*)object;
    return ( dObj->state );

} /* SYS_TMR_Status */

